# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'getantibody/tap/antibody' # ZSH Plugin Manager
brew 'git'
brew 'curl'
brew 'wget'
brew 'grep'
brew 'kubernetes-cli'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'tmux'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'go'
brew 'node'

# Apps
cask '1password'
cask 'aerial'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'kaleidoscope'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'typora'
cask 'visual-studio-code'
cask 'whatsapp'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-menlo-for-powerline'

# Mac App Store
mas 'Giphy Capture', id: 668208984